cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "homebrew/dupes"
tap "homebrew/headonly"
tap "homebrew/versions"
tap "josegonzalez/php"
tap "caskroom/versions"

brew "dockutil"
brew "fish"
brew "heroku-toolbelt"
brew "hub"
brew "jq"
brew "leiningen"
brew "mobile-shell"
brew "php55"
brew "the_silver_searcher"
brew "tree"

cask "atom-beta"
cask "backblaze"
cask "bettertouchtool"
cask "caffeine"
cask "disk-inventory-x"
cask "google-chrome"
cask "hyper"
cask "karabiner-elements"
cask "notion"
cask "p4merge"
cask "scroll-reverser"
cask "shifty"
cask "slack"
cask "steam"
cask "spotify-notifications"
cask "spotify"

brew "mas"
mas "Airmail 3", id: 918858936