cask_args appdir: '/Applications'

tap 'heroku/brew'
tap "homebrew/cask-drivers"
# end tap

brew 'awscli'
brew 'fish'
brew 'gawk'
brew "gh"
brew 'httpie'
brew 'imagemagick'
brew 'less'
brew 'mas'
brew 'ripgrep'
brew 'ruby'
brew 'tree'
brew 'avrdude'
brew 'oh-my-posh'
brew 'postgresql'
brew 'cmake'
brew 'fd'
brew 'coreutils'
brew 'rbenv'
brew 'volta'
brew 'mermaid-cli'
brew 'qmk/qmk/qmk'
brew 'picocom'
brew 'circleci'
brew 'java'
brew 'zsh'
brew 'neovim'

# end brew

cask 'ableton-live-suite'
cask "avidemux"
cask 'blackhole-2ch'
cask 'discord'
cask 'zen'
cask 'focus'
cask 'font-caskaydia-cove-nerd-font'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kicad'
cask 'multitouch'
cask 'scroll-reverser'
cask 'mimestream'
cask 'notion'
cask 'p4v'
cask "raycast"
cask "qmk-toolbox"
cask 'steam'
cask 'slack'
cask 'transmission'
cask "vlc"
cask 'neovide'
cask '1password'
cask '1password-cli'
cask 'zed'
# end cask
