cask_args appdir: '~/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
# end tap

brew 'awscli'
brew "gh"
brew 'heroku'
brew 'lastpass-cli'
brew 'less'
brew 'mas'
brew 'oh-my-posh'
brew 'tree'
brew 'vault'
brew 'coreutils'
brew 'volta'
brew 'circleci'
brew 'zsh'
brew 'httpie'
# end brew

cask 'httpie'
cask 'bettertouchtool'
cask 'discord'
cask 'firefox'
cask 'focus'
cask 'font-caskaydia-cove-nerd-font'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mimestream'
cask 'notion'
cask "raycast"
cask 'spotify'
cask 'visual-studio-code'
# end cask
