cask_args appdir: '~/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
tap "homebrew/cask-drivers"
# end tap

brew 'awscli'
brew 'dark-mode'
brew 'dockutil'
brew 'gawk'
brew "gh"
brew 'heroku'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'lastpass-cli'
brew 'less'
brew 'mas'
brew 'ripgrep'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tree'
brew 'vault'
brew 'avrdude'
brew 'cmake'
brew 'fd'
brew 'coreutils'
brew 'volta'
brew 'mermaid-cli'
brew 'qmk/qmk/qmk'
brew 'circleci'
brew 'java'
# end brew

cask 'bettertouchtool'
cask 'discord'
cask 'dynamic-dark-mode'
cask 'firefox'
cask 'focus'
cask 'font-cascadia-code'
cask 'karabiner-elements'
cask 'mimestream'
cask 'notion'
cask 'p4v'
cask "raycast"
cask 'spotify'
cask 'visual-studio-code'
# end cask
