cask_args appdir: '~/Applications'

puts ENV['laptop_type']

tap 'heroku/brew'
# end tap

brew 'awscli'
brew "gh"
brew 'heroku'
brew 'less'
brew 'mas'
brew 'oh-my-posh'
brew 'tree'
brew 'coreutils'
brew 'volta'
brew 'circleci'
brew 'zsh'
brew 'httpie'
brew 'jq'
brew 'zsh'
# end brew

cask 'httpie'
cask 'discord'
cask 'zen'
cask 'focus'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mimestream'
cask "raycast"
cask 'spotify'
cask 'visual-studio-code'
cask 'multitouch'
cask 'scroll-reverser'
cask '1password'
cask '1password-cli'
# end cask
