cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
# end tap

brew 'awscli'
brew 'dark-mode'
brew 'dockutil'
brew 'fish'
brew 'gawk'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'lastpass-cli'
brew 'less'
brew 'mas'
brew 'ripgrep'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tree'
brew 'vault'
brew 'avrdude'
brew 'postgresql'
brew 'cmake'
brew 'fd'
brew 'coreutils'
brew 'rbenv'
brew 'volta'

# end brew

cask 'bartender'
cask 'bettertouchtool'
cask 'discord'
cask 'dynamic-dark-mode'
cask 'firefox'
cask 'flux'
cask 'focus'
cask 'font-cascadia-code'
cask 'karabiner-elements'
cask 'minecraft'
cask 'notion'
cask 'p4v'
cask 'spotify'
cask 'standard-notes'
cask 'steam'
cask 'visual-studio-code'
# end cask
