cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'caryll/tap'
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
# end tap

brew 'awscli'
brew 'dark-mode'
brew 'dockutil'
brew 'fish'
brew 'gawk'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'less'
brew 'node'
brew 'ripgrep'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tree'
brew 'ttfautohint'
brew 'vault'
brew 'avr-gcc'
brew 'dfu-programmer'
brew 'gcc-arm-none-eabi'
brew 'avrdude'
brew 'postgresql'
brew 'emacs-plus@28', args: %w[with-xwidgets with-modern-cg433n-icon]
# end brew

cask 'backblaze'
cask 'bartender'
cask 'bettertouchtool'
cask 'firefox'
cask 'flux'
cask 'focus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'minecraft'
cask 'notion'
cask 'p4merge'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'spotify-notifications'
cask 'steam'
cask 'transmission'
# end cask

mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Pixelmator', id: 407_963_104
mas 'Jira', id: 1_475_897_096
mas 'Bear', id: 1_091_189_122

# end mas
