cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/headonly"
tap "josegonzalez/php"
tap "caskroom/versions"
tap "caryll/tap"
tap "alexcormier/personal"
# end tap

brew "awscli"
brew "carthage"
brew "composer"
brew "dark-mode"
brew "dockutil"
brew "duti"
brew "fish"
brew "gawk"
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "less"
brew "mosh"
brew "nmap"
brew "node"
brew "nvm"
brew "php@7.1"
brew "poppler"
brew "ruby"
brew "setwp"
brew "the_silver_searcher"
brew "tree"
brew "ttfautohint"
brew "vault"
# end brew

cask "adobe-creative-cloud"
cask "atom"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "caffeine"
cask "disk-inventory-x"
cask "duet"
cask "focus"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "minecraft"
cask "notion"
cask "p4merge"
cask "reaper"
cask "scroll-reverser"
cask "shifty"
cask "sketch"
cask "slack"
cask "spotify"
cask "spotify-notifications"
cask "steam"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "whatsapp"
# end cask

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Boxy 2", id: 1053031090
mas "GIF Brewery 3", id: 1081413713
mas "The Unarchiver", id: 425424353
mas "Icon Slate", id: 439697913
# end mas
