cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/dupes"
tap "homebrew/headonly"
tap "homebrew/versions"
tap "josegonzalez/php"
tap "caskroom/versions"
tap "caryll/tap"
tap "alexcormier/personal"
# end tap

brew "awscli"
brew "carthage"
brew "composer"
brew "dockutil"
brew "fish"
brew "gawk"
brew "heroku-toolbelt"
brew "hub"
brew "jq"
brew "leiningen"
brew "minimal-racket"
brew "mobile-shell"
brew "nmap"
brew "nvm"
brew "phing"
brew "php70"
brew "setwp"
brew "swiftlint"
brew "the_silver_searcher"
brew "tree"
brew "vault"
# end brew

cask "atom-beta"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "caffeine"
cask "disk-inventory-x"
cask "duet"
cask "firefox"
cask "focus"
cask "google-chrome"
cask "hyper"
cask "karabiner-elements"
cask "lastpass"
cask "midikeys"
cask "netspot"
cask "notion"
cask "p4merge"
cask "reaper"
cask "scroll-reverser"
cask "shifty"
cask "sketch"
cask "slack"
cask "steam"
cask "spotify-notifications"
cask "spotify"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vox"
# end cask

mas "Numbers", id: 409203825
mas "Pixelmator", id: 407963104
mas "Boxy 2", id: 1053031090
# end mas
